; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6.1
; Author:	gora <gora@7zsfx.info>
; Homepage:	http://www.gora.7zsfx.info
; Modify by koros aka korosya aka ya158 <koros@ya.ru> http://forum.oszone.net/post-2479402-5.html
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;	
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;	
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Отмена"
MAIN_DEST_DIR_LABEL = "&Папка назначения:"
MAIN_FILE_LABEL = "&Архив/Инсталлятор, который нужно распаковать:"
MENU_FILE_LABEL = "&Файл"
MENU_FILE_QUIT_LABEL = "&Выход"
MENU_EDIT_LABEL = "&Правка"
MENU_EDIT_PREFS_LABEL = "&Настройки"
MENU_OPEN_PASSWORDS_LABEL = "&Открыть passwords.txt"
MENU_HELP_LABEL = "&Помощь"
MENU_HELP_WEB_LABEL = "Сайт программы"
MENU_HELP_ABOUT_LABEL = "О программе"
PREFS_TITLE_LABEL = "Настройки"
PREFS_UNIEXTRACT_OPTS_LABEL = "Опции Universal Extractor"
PREFS_HISTORY_LABEL = "Сохранять &историю"
PREFS_NODOSWIN_LABEL = "Скрывать окно консоли"
PREFS_MINDOSWIN_LABEL = "Свернуть окно консоли"
PREFS_SAVEPASS_LABEL = "Сохранять пароль в списке паролей"
PREFS_FORMAT_OPTS_LABEL = "Расширенные настройки"
PREFS_LANG_LABEL = "&Язык"
PREFS_DEBUG_LABEL = "&Сохранять файл отладки в:"
PREFS_LOG_LABEL = "&Сохранять логфайл в:"
PREFS_LOG_LABEL_ALWAYS = "&Всегда"
PREFS_WARN_EXECUTE_LABEL = "&Запрос перед запуском файлов"
PREFS_REMOVE_DUPE_LABEL = "&Удалять дубликаты файлов"
PREFS_REMOVE_TEMP_LABEL = "Удалять &временные файлы"
PREFS_APPEND_EXT_LABEL = "&Добавлять расширение к файлам"
METHOD_ADMIN_RADIO = "%s административная установка"
METHOD_EXTRACTION_RADIO = "%s извлечение"
METHOD_HEADER = "%s извлечение"
METHOD_MSI_NOTE_LABEL = "Примечание: "
METHOD_MSI_REQUIRES_LABEL = "для msi2xml метода требуется"
METHOD_MSI_URL_LABEL = "MSXML 6.0 Parser"
METHOD_RADIO_LABEL = "Метод извлечения"
METHOD_SWITCH_RADIO = "%s ключ"
METHOD_NOTIS_RADIO = "Это не инсталлятор InstallShield"
METHOD_TEXT_LABEL = "%s поддерживает несколько методов извлечения %s. К сожалению, ни один из этих методов не надёжен на 100%. Если заданный по умолчанию метод не работает, пожалуйста, запустите %s ещё раз и выберите альтернативный метод."
METHOD_UNPACKER_RADIO = "%s распаковщик"
PE_ANALIZATORS = "Анализаторы PE-файлов"

; GUI control functions
DOES_NOT_EXIST = "не существует.%n"
EXTRACT_TO = "Извлечь в"
INVALID_DIR_SELECTED =  "%s неверная папка."
INVALID_FILE_SELECTED = "%sПожалуйста, выберите верный файл."
OPEN_FILE = "Открыть файл"
SELECT_FILE = "Выбрать файл"
WRITE_TO = "Сохранить в"

; Common terms
TERM_ARCHIVE = "архива"
TERM_COMPRESSED = "сжатого файла"
TERM_CONTAINER = "контейнера"
TERM_DISK = "диска"
TERM_EBOOK = "электронной книги"
TERM_ECARD = "электронной открытки"
TERM_ENCODED = "закодированного файла"
TERM_EXECUTABLE = "исполняемого файла"
TERM_FAILED = "неудача"
TERM_HELP = "файла справки"
TERM_HOTFIX = "хотфикса"
TERM_IMAGE = "образа"
TERM_INSTALLER = "инсталлятора"
TERM_MERGE_MODULE = "модуля слияния"
TERM_PACKAGE = "пакета"
TERM_PATCH = "патча"
TERM_SCRIPT = "скомпилированный скрипт"
TERM_SFX = "SFX"
TERM_STAGE = "стадия"
TERM_SUCCEEDED = "следующий"
TERM_TESTING = "Тестирование"
TERM_UNKNOWN = "неизвестного"
TERM_UNPACKED = "неупакованный"
TERM_UPDATER = "обновление"

; Status messages
SCANNING_FILE = "Анализ типа файла."
SCANNING_EXE = "Анализ файла с помощью %s."
EXTRACTING = "Извлечение файлов из:"
INIT_WAIT = "Ожидание запуска инсталлятора.%nПожалуйста, подождите."

; Custom prompts
CONVERT_CDROM = "CD-образы не могут быть извлечены напрямую. Образ%nбудет преобразован в ISO-образ, который и будет извлечен.%n%nПродолжить?%nПримечание: этот процесс потребует нескольких минут."
CONVERT_CDROM_STAGE1_FAILED = "Ошибка: CD-образ не может быть преобразован.%nЕсли это BIN/CUE-образ, убедитесь в правильности формата файла CUE."
CONVERT_CDROM_STAGE2_FAILED = "Ошибка: ISO-образ был создан из %s образа, но он не может быть конвертирован.%nХотите сохранить ISO образ для дальнейшего анализа?"
CONVERT_BIN_MISSING = "Ошибка: не найден:%n%s\%s.%s%n%nДля работы необходимы два файла: %s.BIN, и %s.CUE"
INIT_COMPLETE = "Инициализация %s. Выйдите из инсталлятора, затем нажмите "OK", чтобы продолжить."
WISE_MSI_PROMPT = "Внимание: этот метод работает только с определенными типами пакетов Windows Installer.%nЕсли Wise Installation Wizard запустится и останется в режиме ожидания, значит, этот файл не%nподдерживается. Тогда закройте инсталлятор, и %s извлечение будет прервано.%n%nПродолжить?"
UNPACK_PROMPT = "Этот файл упакован со %s сжатием, но не может быть извлечён.%nВозможно, тип файла не поддерживается, или%nпросто нет файлов, которые можно было бы извлечь.%n%nВсё равно хотите распаковывать этот файл?%n%nПримечание: Распакованный файл будет назван:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Ошибка: %s%nне может быть распакован.%nПодробности см. в лог-файле %s.%n%nНажмите "OK", чтобы просмотреть лог-файл, или "Отмена", чтобы выйти."
WARN_EXECUTE = "Внимание:  для того, чтобы извлечь содержимое файлов такого типа, файл необходимо запустить.%nЕсли Вы продолжите, будет выполнена следующая команда:%n%n%s%n%nЕсли Вы предполагаете, что этому файлу не следует доверять (как malicious - "злонамеренному"), не рекомендуется продолжать.%nХотите ли Вы продолжить извлечение?"
WARN_FILE_EXIST = "Внимание: Невозможно создать папку %s, так как существует файл %s.%nХотите распаковать в папку %s_extracted?%n%n%tДА - распаковка в папку %s_extracted%n%tНЕТ - выбор папки назначения%n%tОТМЕНА - распаковка в папку %s_%s"
WARN_DIR_EXIST = "Внимание:  Папка назначения %s уже существует! Хотите очиcтить папку перед распаковкой?%n%n%tДА - Очистить папку и распаковать%n%tНЕТ - выбор папки назначения%n%tОТМЕНА - распаковка в папку %s без очистки"
DOTNET_FAILED = "Ошибка: Для работы %s должен быть установлен .Net Framework %s"
ASK_PASSWORD = "Для распаковки требуется пароль.%nНи один из списка паролей (passwords.txt) не подходит.%nВведите пароль для распаковки"
MOVE_COPY_FILES = "Перемещение/Копирование:"
TO =  ""%s" в "%s""

; Help text
HELP_SUMMARY = "Извлечение файлов из архива любого типа или инсталляционного пакета."
HELP_SYNTAX = "%nИспользование:  %s [/help | /prefs] [filename [destination]]"
HELP_ARGUMENTS = "%n%nПоддерживаемые параметры:"
HELP_HELP = "%n     /help%t%tПоказать эту справку"
HELP_PREFS = "%n     /prefs%t%tВывести диалог 'Настройки' UniExtract"
HELP_LANG = "%n     /lang <lang>%tИзменение языка интерфейса.%n%t%t<lang> Имя языкового файла *.ini"
HELP_FILENAME = "%n     filename%tИмя извлекаемого файла"
HELP_DESTINATION = "%n     destination%tПуть\имя папки для извлечения"
HELP_SUB = "%n%nУказание /sub вместо имени папки для извлечения заставит %n%s извлекать в подкаталог, названный по имени архива."
HELP_EXAMPLE1 = "%n%nПример:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nПри запуске %s без параметров будет выдан запрос%nоб имени файла и папке для извлечения."

; Error messages
CANNOT_LOG = "Ход извлечения из %s невозможно записать в лог."
CANNOT_DEBUG = "В папке для файла отладки, "%s", запрещено сохранение.%nВместо этого файл будет записан во временную папку."
CANNOT_EXTRACT = "%s невозможно извлечь.%nТип файла: %s%n%nНажмите "OK", если хотите анализировать файл, или "Отмена", чтобы выйти."
UNKNOWN_EXT = "%s%nимеет неизвестное расширение и не может быть извлечён."
INVALID_DIR = "%s%nневозможно создать. Выберите правильный адрес."
EXTRACT_FAILED = "%s не может быть извлечён.%nИзвлечение этого %s, возможно поддерживается, но оно неудачно.%nПодробности см. в лог-файле %s.%n%nНажмите "OK", чтобы просмотреть лог-файл, или "Отмена", чтобы выйти."
INVALID_PASSWORD = "%s  не может быть извлечён.%n%nФайл защищен с помощью пароля и пароль, введенный вами не подходит.%n%nТакже не подходит ни один из списка паролей (passwords.txt), котрый находится в папке Universal Extractor-а."
INVALID_LANGFILE = "Не найден языковой файл %s. Будет использоваться прежний язык интерфейса."

; Log
APPEND_EXTENSIONS = "Добавление расширений к файлам при помощи TrID в папке "%s""
ARCHIVE = "архивом"
ASKED_PASSWORD = "Запрос пароля у пользователя"
COMLINE_PARAMETRS = "запущен с параметрами комстроки:"
COPY_FILES = "Скопировано: "%s" в "%s""
DEBUG_FILE = "Файл отладки:"
DEL_FILES = "Удалено: "%s""
DELETE_FILE = "Удаление файла:"
DEST_DIR = "Папка назначения:"
DIR_CREATE = "Создана папка: "%s""
DIR_EXIST = "Папка назначения "%s" уже существует"
ERROR_READING_OPTION = "Ошибка считывания опции:  %s --> %s"
EXECUTING = "Строка запуска:"
EXTRACT_FAILE = ""%s" не может быть извлечён. Извлечение этого "%s", возможно поддерживается, но оно неудачно."
EXTRACT_SUCCESS = "Распаковка успешно завершена"
EXTRACTING_7ZIP = "Извлечение файла конфигурации и sfx-модуля из SFX-архива"
EXTRACTING_CPIO = "Извлечение из вложенного файла CPIO для RPM пакета Linux"
EXTRACTING_DEB = "Извлечение из вложенного файла TAR для Debian пакета Linux"
FAILED_COPY = "Ошибка при копировании: "%s" в "%s""
FAILED_CREATE = "Ошибка при создании: "%s""
FAILED_DEL = "Ошибка при удалении: "%s""
FAILED_MOVE = "Ошибка при перемещении: "%s" в "%s""
FALSE_TESTING = "Файл не является"
FILE_EXIST = Невозможно создать папку назначения "%s", так как существует файл "%s"
FILE_PROCESSING = "Файл для обработки:"
FILE_PROPERTIES = "Свойства файла:"
FILE_UNICODE = "Предположительно в имени исходного файла или в пути к нему содержаться символы Юникода. Исходный файл будет перемещен/скопирован во временную папку"
FILE_VER = "Версия файла:"
FIRST = "Проверяется расширение файла на необходимость применения специальных методов распаковки"
FOURTH = "Используется расширение файла для распаковки, поскольку сигнатура не распознана"
INSTALLER = "инсталлятором"
LANG_INTERFACE = "Язык интерфейса изменен на"
LOG = "Лог работы:"
MATCH_PATTERN = "Проверка на совпадение с известными паттернами"
MOVE_FILES = "Перемещено: "%s" в "%s""
NO_MATCH = "Совпадений не найдено"
NOT_TRANLATION = "Не найден перевод для выражения: %s"
OPTION = "Опция: %s = %s"
PASSWORD_FOUND = "Найден пароль: %s"
PASSWORDS = "Файл защищен паролем"
PRODUCT_NAME = "Название продукта:"
READING_FROM = "Чтение настроек из"
REGISTRY = "реестра"
RUN_OPTION = "Рабочий каталог: "%s".  Режим отображения запускаемой программы: %s"
SAVE_PASSWORD = "Сохранение пароля в списке паролей (passwords.txt)"
SAVE_PREF = "Сохранение настроек"
SAVING = "Сохранение: %s = %s"
SAVING_TO = "Сохранение в"
SCANNING_EPE_EXTERNAL = "Сканирование с помощью внешней базы сигнатур"
SCANNING_EPE_STANDART = "Сканирование с помощью внутренней базы сигнатур"
SCRIPT = "скомпилированным скриптом"
SECOND = "Анализ файла с помощью TrID"
SET_PATH = "Переменная среды "Path" ="
START_FILESCAN = "Запуск сканирования файла "%s" с помощью %s"
TEMP_UNICODE = "Путь к папке для временных файлов содержит символы Юникода, отмена"
THIRD = "Анализ исполняемого файла"
TRYING_PASSWORDS = "Проверка %s паролей(я) из списка паролей (passwords.txt)"
UNICODE_BACK = "Обратное копирование\перемещение исходного файла из временной папки"
UNPACK = "Распаковка упакованных исполняемых файлов. Упаковщик: "%s""
UNPACK_FAILE = "Ошибка: "%s" не может быть распакован."
WARN_TRANLATION = "Внимание: выражение "%s" не определено"
WITHOUT_COMLINE_PARAMETRS = "запущен без параметров комстроки"

[Installer]
; Components page
COMP_DOCS = "Документация и информация о лицензии"
COMP_LANG = "Языковые файлы"
COMP_ACE = "Поддержка файлов ACE"
COMP_KGB = "Поддержка файлов KGB"
COMP_PEA = "Поддержка файлов Pea"
COMP_SIT = "Поддержка файлов StuffIt"

; Preferences page
PREFS_CAPTION = "Опции программы"
PREFS_DESCRIPTION = "Какие опции Universal Extractor'а нужно установить?"
PREFS_LABEL1 = "Можно установить следующие опции по умолчанию."
PREFS_LABEL2 = "Эти опции могут быть изменены после инсталляции путём правки файла UniExtract.ini."
LANGUAGE_LABEL = "Язык по умолчанию"
DEBUG_LABEL = "Расположение файла отладки"
APPEND_EXT_LABEL = "&Добавлять отсутствующее расширение файла"
HISTORY_LABEL = "&Сохранять историю архива"
REMOVE_DUPE_LABEL = "Удалять &дубли файлов"
REMOVE_TEMP_LABEL = "Удалять &временные файлы"
WARN_EXECUTE_LABEL = "&Спрашивать перед запуском файлов"

; Tasks page
ASSOCIATE = "&Интеграция в контекстное меню Проводника"
ASSOCIATE_FILES = "Добавить 'UniExtract &файлы' в контекстное меню"
ASSOCIATE_HERE = "Добавить 'UniExtract &здесь' в контекстное меню"
ASSOCIATE_SUBDIR = "Добавить 'UniExtract в &папку' контекстное меню"
ASSOCIATE_FORCE = "Принудительно &ассоциировать со всеми поддерживаемыми архивными форматами"
MODIFY_PATH = "Добавить Universal Extractor в System &Path"
DESKTOP_ICON = "Создать ярлык &на рабочем столе"
QUICK_LAUNCH_ICON = "Создать ярлык &на панели быстрого запуска"
SENDTO_ICON = "Создать ярлык "Отправить...""

; Context Menu integration
EXTRACT_FILES = "UniExtract &файлы"
EXTRACT_HERE = "UniExtract &здесь"
EXTRACT_SUB = "UniExtract в &папку"

